app/Http/Controllers/EventController.php

SELECT * FROM `events`
---
    public function index()
    {
        $events = Event::all();